# Sample Snippet: RevitUtils

Source project: `existingCodes\梁涛插件源代码\11.其他\RevitUtils\RevitUtils`

This is a compact reference excerpt generated from existing plug-ins. It preserves the command structure and key API usage without requiring the full `existingCodes/` tree during normal skill use.

## CreateUtils.cs

```csharp
using Autodesk.Revit.DB;
using Autodesk.Revit.UI;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RevitUtils
{
    public class CreateUtils
    {
        /// <summary>
        /// 创建文字注释（内部无事务）
        /// </summary>
        /// <param name="uidoc"></param>
        /// <param name="text">文本内容</param>
        /// <param name="centerP">创建点</param>
        /// <param name="elem">元素（用来校对文字注释旋转角度）</param>
        public static void CreateTextNote(UIDocument uidoc, string text, XYZ centerP, Element elem)
        {
            Document doc = uidoc.Document;
            FilteredElementCollector collector1 = new FilteredElementCollector(doc);
            ICollection<Element> textNoteTypes = collector1.OfClass(typeof(TextNoteType)).ToElements();
            TextNoteType textNoteType = null;
            foreach (TextNoteType textType in textNoteTypes)
            {
                if (textType?.FamilyName == "文字")
                {
                    textNoteType = textType;
                    break;
                }
            }
            View view = uidoc.ActiveView;
            TextNote textNote = TextNote.Create(doc, view.Id, centerP, text, textNoteType.Id);

            //移动文本 使得文本下边中心对其元素中点
            textNoteType.get_Parameter(BuiltInParameter.LEADER_OFFSET_SHEET).Set(0);
            textNoteType.get_Parameter(BuiltInParameter.TEXT_SIZE).SetValueString("1.5 mm");
            view.Document.Regenerate();
            double scale = view.Scale;
            double textNoteWidth = textNote.Width * scale;

            // 计算偏移量，使对齐点为文本的下边中心
            XYZ offset = new XYZ(-textNoteWidth / 2, 1.25, 0);

            // 移动文本注释的位置
            ElementTransformUtils.MoveElement(doc, textNote.Id, offset);

            LocationPoint locationPoint = elem.Location as LocationPoint;
            double rota = locationPoint.Rotation;

            Line axis = Line.CreateBound(centerP, centerP + new XYZ(0, 0, 1));
            //if (elem.Name == "风管法兰吊架-上固定" || elem.Name == "风管法兰吊架-下固定" || elem.Name.Contains("风管法兰抗震吊架"))
            //{

            //    ElementTransformUtils.RotateElement(doc, textNote.Id, axis, rota + (Math.PI / 2));
            //}
            //else
            //{
            //    ElementTransformUtils.RotateElement(doc, textNote.Id, axis, rota);
            //}
            ElementTransformUtils.RotateElement(doc, textNote.Id, axis, rota);
            return;
            while (true)
            {
                if (((textNote.get_BoundingBox(view).Max + (textNote.get_BoundingBox(view).Min)) / 2).Y > centerP.Y)
                {
                    break;
                }
                else if (((textNote.get_BoundingBox(view).Max + (textNote.get_BoundingBox(view).Min)) / 2).Y == centerP.Y)
                {
                    if (((textNote.get_BoundingBox(view).Max + (textNote.get_BoundingBox(view).Min)) / 2).X < centerP.X)
                    {
                        break;
                    }
                }
                ElementTransformUtils.RotateElement(doc, textNote.Id, axis, Math.PI);
            }
        }
    }
}

```

## CurveUtils.cs

```csharp
using Autodesk.Revit.DB;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RevitUtils
{
    public static class CurveUtils
    {
        public static Line GetLine(this Element element)
        {
            Line line = null;
            if (element.Location != null && element.Location is LocationCurve locationCurve && locationCurve.Curve is Line line1)
                line = line1;

            return line;
        }

        public static double GetDistance(this Element elem1, Element elem2)
        {
            double distance = double.MaxValue;
            XYZ point1 = elem1.GetCreatePoint();
            XYZ point2 = elem2.GetCreatePoint();
            if (point1 != null && point2 != null)
            {
                distance = point1.DistanceTo(point2);
            }
            return distance;
        }
    }
}

```

## ElementUtils.cs

```csharp
using Autodesk.Revit.DB.Electrical;
using Autodesk.Revit.DB;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RevitUtils
{
    public static class ElementUtils
    {
        /// <summary>
        /// 根据ID获取元素
        /// </summary>
        /// <param name="elementId"></param>
        /// <param name="doc"></param>
        /// <returns></returns>
        public static Element GetElement(this ElementId elementId, Document doc)
        {
            return doc.GetElement(elementId);
        }
        /// <summary>
        /// 根据引用获取元素
        /// </summary>
        /// <param name="reference"></param>
        /// <param name="doc"></param>
        /// <returns></returns>
        public static Element GetElement(this Reference reference, Document doc)
        {
            return doc.GetElement(reference);
        }
        /// <summary>
        /// 获取链接模型中的元素
        /// </summary>
        /// <param name="reference">链接模型中元素上的一点</param>
        /// <param name="doc"></param>
        /// <returns></returns>
        public static Element GetLinkElement(this Reference reference, Document doc)
        {
            Element linkElem = null;
            Element elem = doc.GetElement(reference);
            if (elem is RevitLinkInstance linkInstance)
            {
                Document linkDoc = linkInstance.GetLinkDocument();
                linkElem = linkDoc.GetElement(reference.LinkedElementId);
            }

            return linkElem;
        }

        /// <summary>
        /// 获取灯具的宿主元素
        /// </summary>
        /// <param name="element"></param>
        /// <param name="doc"></param>
        /// <param name="zDir"></param>
        /// <param name="findHeight"></param>
        /// <returns></returns>
        public static Element GetHostElement(this Element element, Document doc, XYZ zDir, double findHeight)
        {
            Element hostElem = null;

            var boundingBox = element.get_BoundingBox(null);
            XYZ min = boundingBox.Min;
            XYZ max = boundingBox.Max;
            Outline outline = new Outline(min, new XYZ(max.X, max.Y, max.Z + findHeight));

            XYZ cp = element.GetCreatePoint();
            Solid solid = SolidUtils.CreateSolid(XYZ.BasisX, cp, 50 / 304.8, 50 / 304.8, zDir, findHeight);

            List<Element> lightCables = new FilteredElementCollector(doc, doc.ActiveView.Id).OfCategory(BuiltInCategory.OST_CableTray).OfClass(typeof(CableTray)).WherePasses(new BoundingBoxIntersectsFilter(outline))
                .WherePasses(new ElementIntersectsSolidFilter(solid)).ToList();
            lightCables = lightCables.OrderBy(x => x.GetLine().Project(cp).XYZPoint.DistanceTo(cp)).ToList();
            hostElem = lightCables.FirstOrDefault();
            return hostElem;
        }
    }
}

```